"""
Задача №1
Визначте кількість парних елементів в послідовності, яка завершується числом 0.
Вводиться послідовність цілих чисел, що закінчується числом 0
(саме число 0 в послідовність не входить, а використовується як ознака її закінчення).

Автор: Задворна Анастасія Богданівна
"""

count_even = 0
number = -1

while number != 0:
    number = int(input("Введіть число (введення 0 завершить програму): "))

    if number % 2 == 0 and number !=0:
        count_even += 1

print(f"Кількість парних елементів: {count_even}")
